<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1ec38b4002f63d989431dbabbcdee2795433636ff41caad2c7f601a0cde55437","plan_job_ref":"Job Terraform Plan #21 at https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5663346314","plan_hash":"fadc84c0ab1e8deb0e07ba31ecea8f00fc8e3f4e66a67d2ce71ff853562f8f88","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __non-prod__
With var files: `non-prod/non-prod.tfvars`
<details>
<summary>Plan: 21 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.app-manager-kafka-api-key will be created
  + resource "confluent_api_key" "app-manager-kafka-api-key" {
      + description            = "Kafka API Key that is owned by 'app-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "app-manager-kafka-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-rvw7k"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_api_key.consumer-api-key will be created
  + resource "confluent_api_key" "consumer-api-key" {
      + description            = "Kafka API Key that is owned by 'consumer' service account"
      + disable_wait_for_ready = false
      + display_name           = "consumer-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-rvw7k"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_api_key.env-manager-schema-registry-api-key will be created
  + resource "confluent_api_key" "env-manager-schema-registry-api-key" {
      + description            = "Schema Registry API Key that is owned by 'env-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "env-manager-schema-registry-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-rvw7k"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_api_key.ksqldb-api-key will be created
  + resource "confluent_api_key" "ksqldb-api-key" {
      + description            = "KsqlDB API Key that is owned by 'app-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "ksqldb-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-rvw7k"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_api_key.producer-api-key will be created
  + resource "confluent_api_key" "producer-api-key" {
      + description            = "Kafka API Key that is owned by 'producer' service account"
      + disable_wait_for_ready = false
      + display_name           = "producer-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-rvw7k"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_kafka_acl.app_consumer_acl will be created
  + resource "confluent_kafka_acl" "app_consumer_acl" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "READ"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "*"
      + resource_type = "TOPIC"
      + rest_endpoint = (known after apply)

      + credentials {
          + key    = (sensitive value)
          + secret = (sensitive value)
        }

      + kafka_cluster {
          + id = (known after apply)
        }
    }

  # confluent_kafka_acl.app_producer_acl will be created
  + resource "confluent_kafka_acl" "app_producer_acl" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "WRITE"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "*"
      + resource_type = "TOPIC"
      + rest_endpoint = (known after apply)

      + credentials {
          + key    = (sensitive value)
          + secret = (sensitive value)
        }

      + kafka_cluster {
          + id = (known after apply)
        }
    }

  # confluent_kafka_cluster.dedicated will be created
  + resource "confluent_kafka_cluster" "dedicated" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = "non-prod"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-east-1"
      + rest_endpoint      = (known after apply)

      + dedicated {
          + cku   = 2
          + zones = (known after apply)
        }

      + environment {
          + id = "env-rvw7k"
        }
    }

  # confluent_kafka_topic.REPLACE_ME will be created
  + resource "confluent_kafka_topic" "REPLACE_ME" {
      + config           = (known after apply)
      + id               = (known after apply)
      + partitions_count = 3
      + rest_endpoint    = (known after apply)
      + topic_name       = "REPLACE_ME"

      + credentials {
          + key    = (sensitive value)
          + secret = (sensitive value)
        }

      + kafka_cluster {
          + id = (known after apply)
        }
    }

  # confluent_ksql_cluster.ksql will be created
  + resource "confluent_ksql_cluster" "ksql" {
      + api_version                 = (known after apply)
      + csu                         = 12
      + display_name                = "ksql-non-prod"
      + id                          = (known after apply)
      + kind                        = (known after apply)
      + resource_name               = (known after apply)
      + rest_endpoint               = (known after apply)
      + storage                     = (known after apply)
      + topic_prefix                = (known after apply)
      + use_detailed_processing_log = true

      + credential_identity {
          + id = (known after apply)
        }

      + environment {
          + id = "env-rvw7k"
        }

      + kafka_cluster {
          + id = (known after apply)
        }
    }

  # confluent_role_binding.app-ksql-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "app-ksql-kafka-cluster-admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "CloudClusterAdmin"
    }

  # confluent_role_binding.app-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "app-manager-kafka-cluster-admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "CloudClusterAdmin"
    }

  # confluent_role_binding.developer-read will be created
  + resource "confluent_role_binding" "developer-read" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "DeveloperRead"
    }

  # confluent_role_binding.developer-write will be created
  + resource "confluent_role_binding" "developer-write" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "DeveloperWrite"
    }

  # confluent_role_binding.env-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "env-manager-kafka-cluster-admin" {
      + crn_pattern = "crn://confluent.cloud/organization=ebfa2bb8-8dfa-4d73-a075-9da6b5c3a3b5/environment=env-rvw7k/cloud-cluster=lkc-1j1r83"
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "EnvironmentAdmin"
    }

  # confluent_schema_registry_cluster.essentials will be created
  + resource "confluent_schema_registry_cluster" "essentials" {
      + api_version   = (known after apply)
      + display_name  = (known after apply)
      + id            = (known after apply)
      + kind          = (known after apply)
      + package       = "ESSENTIALS"
      + resource_name = (known after apply)
      + rest_endpoint = (known after apply)

      + environment {
          + id = "env-rvw7k"
        }

      + region {
          + id = "sgreg-1"
        }
    }

  # confluent_service_account.app-consumer will be created
  + resource "confluent_service_account" "app-consumer" {
      + api_version  = (known after apply)
      + description  = "Service Account for app consumers"
      + display_name = "app-consumer-service-account"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

  # confluent_service_account.app-ksql will be created
  + resource "confluent_service_account" "app-ksql" {
      + api_version  = (known after apply)
      + description  = "Service account to manage ksql-non-prod ksqlDB cluster"
      + display_name = "ksql-non-prod"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

  # confluent_service_account.app-manager will be created
  + resource "confluent_service_account" "app-manager" {
      + api_version  = (known after apply)
      + description  = "Service account to manage 'non-production' the Kafka & ksqlDB clusters"
      + display_name = "app-manager"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

  # confluent_service_account.app-producer will be created
  + resource "confluent_service_account" "app-producer" {
      + api_version  = (known after apply)
      + description  = "Service Account for app producer"
      + display_name = "app-producer-service-account"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

  # confluent_service_account.env-manager will be created
  + resource "confluent_service_account" "env-manager" {
      + api_version  = (known after apply)
      + description  = "Service account to manage 'production' environment Kafka Schema Registry"
      + display_name = "env-manager"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_version        = (known after apply)
  + bootstrap_endpoint = (known after apply)
  + environment_id     = "*********"
  + id                 = (known after apply)
  + kind               = (known after apply)
  + rbac_crn           = (known after apply)
  + region             = "us-east-1"
  + rest_endpoint      = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #21](https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5663346314)